Revit 2024 API
BuiltInFailures.GlobalParameterFailures.InvalidElementPropToGlobalParamLink Property
 The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidElementPropToGlobalParamLink { get; }
Visual Basic
Public Shared ReadOnly Property InvalidElementPropToGlobalParamLink As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidElementPropToGlobalParamLink {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace